app/controllers/api/v1/influencers_controller.rb

INSERT INTO "influencer_authorizations" ("provider", "provider_uid", "oauth_token", "social_account", "influencer_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
INSERT INTO "influencers" ("first_name", "last_name", "email", "date_of_birth", "gender", "location", "no_of_friends", "profile_picture_url", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10) RETURNING "id"
---
  def create
    @influencer = Influencer.new(first_name: facebook_client.first_name,
                                 last_name: facebook_client.last_name,
                                 email: facebook_client.email,
                                 bio: facebook_client.bio,
                                 date_of_birth: facebook_client.birthday,
                                 gender: facebook_client.gender,
                                 location: facebook_client.location,
                                 profile_picture_url: facebook_client.profile_picture_url)

    @influencer.influencer_authorizations.build(
                    provider: 'facebook',
                    provider_uid: facebook_client.user_id,
                    oauth_token: facebook_user_token,
                    social_account: '')

    @influencer.save()