app/controllers/api/v1/influencers_twitter_controller.rb

INSERT INTO "influencer_authorizations" ("provider", "provider_uid", "oauth_token", "social_account", "influencer_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
INSERT INTO "influencers" ("first_name", "no_of_friends", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["first_name", "Renil Raphy"], ["no_of_friends", "3"], ["created_at", "2016-05-11 08:48:09.798684"], ["updated_at", "2016-05-11 08:48:09.798684"]]
---
  def create
    @influencer = Influencer.new(first_name: twitter_client.name,
                                 bio: twitter_client.description,
                                 location: twitter_client.location,
                                 profile_picture_url: twitter_client.profile_background_image_url)

    @influencer.influencer_authorizations.build(
                    provider: 'twitter',
                    provider_uid: twitter_client.id,
                    oauth_token: twitter_access_token)

    @influencer.save()