app/controllers/engagement_controller.rb

INSERT INTO "engagements" ("post_content", "post_file", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["post_content", "sdfsfsfdsfsfsdffd"], ["post_file", "12mar_ABCD-3Dmovie.jpg"], ["created_at", "2016-05-11 10:20:50.016699"], ["updated_at", "2016-05-11 10:20:50.016699"]]
---
  def create
    @engagement = Engagement.new(
      post_content: params["post_content"],
      post_file: params["post_file"]
    )
    print "----------1----------"
    print params["post_file"]
    print @engagement.inspect
    print "----------2---------"
    if @engagement.save

SELECT "engagements".* FROM "engagements"
---
  def index
    @engagements = Engagement.all()