app/controllers/influencers_instagram_controller.rb

  def create
    @influencer = Influencer.new(first_name: instagram_client.full_name,
                                 username: instagram_client.username,
                                 bio: instagram_client.bio,
                                 profile_picture_url: instagram_client.profile_picture)

    @influencer.influencer_authorizations.build(
                    provider: 'instagram',
                    provider_uid: instagram_client.id,
                    oauth_token: session[:access_token])

    @influencer.save()
---
INSERT INTO "influencer_authorizations" ("provider", "provider_uid", "oauth_token", "influencer_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"
INSERT INTO "influencers" ("first_name", "username", "bio", "no_of_friends", "profile_picture_url", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"