app/controllers/influencer_controller.rb

  def index
    @influencers = Influencer.all
---
SELECT "influencers".* FROM "influencers"