app/controllers/instagram_post_controller.rb

SELECT  "influencers".* FROM "influencers" WHERE "influencers"."id" = $1 LIMIT 1  [["id", 2]]
---
  def set_influencer
    @influencer = Influencer.find(params[:id])