app/controllers/post_controller.rb

  def create
    if params.key?("source") && params["source"] != ""
      post_result = @client.put_connections("me", "photos", caption: params["message"], url: params["source"])
    end

    social_account = @influencer.influencer_authorizations[0].social_account
    if social_account != "" && social_account != nil
      social_account += "," + post_result["post_id"]
    else
      social_account = post_result["post_id"]
    end
    @influencer.influencer_authorizations[0].update({social_account: social_account})
---
UPDATE "influencer_authorizations" SET "social_account" = $1, "updated_at" = $2 WHERE "influencer_authorizations"."id" = $3  [["social_account", "816811745027019_1151913574850166"], ["updated_at", "2016-05-04 10:17:47.404469"], ["id", 1]]

  def set_influencer
    @influencer = Influencer.find(params[:id])
---
SELECT  "influencers".* FROM "influencers" WHERE "influencers"."id" = $1 LIMIT 1  [["id", 1]]