app/controllers/twitter_post_controller.rb

UPDATE "influencer_authorizations" SET "social_account" = $1, "updated_at" = $2 WHERE "influencer_authorizations"."id" = $3  [["social_account", "727887700255182853"], ["updated_at", "2016-05-04 15:48:46.238442"], ["id", 2]]
---
  def create
    if params.key?("message") && params["message"] != ""
      post_result = @twitter_client.update(params["message"])
    end

    social_account = @influencer.influencer_authorizations[0].social_account
    if social_account != "" && social_account != nil
      social_account += "," + (post_result["id"]).to_s
    else
      social_account = post_result["id"]
    end
    @influencer.influencer_authorizations[0].update({social_account: social_account})

SELECT  "influencers".* FROM "influencers" WHERE "influencers"."id" = $1 LIMIT 1  [["id", 2]]
---
  def set_influencer
    @influencer = Influencer.find(params[:id])